[
  {
    "id": 1,
    "grade_level": "grade_1_2",
    "domain": "social_instructional",
    "difficulty": 1,
    "prompt_type": "picture",
    "prompt_text": "Look at this picture and tell me about your family. How many people are in your family? Who are they?",
    "image_url": "https://images.unsplash.com/photo-1511895426328-dc8714191300?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "There are four people in my family. I have a mother, a father, and a brother. My mother is a teacher. My father works in an office. My brother is younger than me.",
    "rubric": ["Uses complete sentences", "Includes number of family members", "Names family members", "Speaks clearly"]
  },
  {
    "id": 2,
    "grade_level": "grade_1_2",
    "domain": "social_instructional",
    "difficulty": 1,
    "prompt_type": "picture",
    "prompt_text": "Look at this picture of a park. Tell me what you see in the picture.",
    "image_url": "https://images.unsplash.com/photo-1547979006-287cb5e8bf4f?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "I see a big park. There are many trees and flowers. Children are playing on the swings. Some people are sitting on benches. There is a dog running in the grass.",
    "rubric": ["Describes main objects in picture", "Uses appropriate vocabulary", "Forms complete sentences", "Speaks at appropriate pace"]
  },
  {
    "id": 3,
    "grade_level": "grade_1_2",
    "domain": "mathematics",
    "difficulty": 2,
    "prompt_type": "picture",
    "prompt_text": "Look at the numbers in this picture. Count from one to twenty. Then tell me which number comes after fifteen.",
    "image_url": "https://images.unsplash.com/photo-1509228468518-180dd4864904?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "One, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve, thirteen, fourteen, fifteen, sixteen, seventeen, eighteen, nineteen, twenty. The number after fifteen is sixteen.",
    "rubric": ["Counts accurately", "Pronounces numbers clearly", "Identifies correct number", "Completes the task"]
  },
  {
    "id": 4,
    "grade_level": "grade_3_5",
    "domain": "language_arts",
    "difficulty": 2,
    "prompt_type": "picture",
    "prompt_text": "Look at these books. Tell me about your favorite book. What is it about? Why do you like it?",
    "image_url": "https://images.unsplash.com/photo-1512820790803-83ca734da794?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "My favorite book is 'Charlotte's Web.' It is about a pig named Wilbur and his friend Charlotte, who is a spider. Charlotte helps Wilbur by writing words in her web. I like this book because it shows the importance of friendship and kindness.",
    "rubric": ["Names the book", "Summarizes the story", "Explains personal opinion", "Uses descriptive language"]
  },
  {
    "id": 5,
    "grade_level": "grade_3_5",
    "domain": "science",
    "difficulty": 3,
    "prompt_type": "picture",
    "prompt_text": "Look at this picture showing the water cycle. Explain what happens during the water cycle. Include the words evaporation, condensation, and precipitation in your answer.",
    "image_url": "https://images.unsplash.com/photo-1542135193-8585bc49a969?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "The water cycle is how water moves around the Earth. First, evaporation happens when the sun heats water and it turns into vapor. Then, condensation occurs when the vapor cools and forms clouds. Finally, precipitation happens when water falls from clouds as rain or snow.",
    "rubric": ["Uses all three vocabulary words correctly", "Explains the process in order", "Shows understanding of the concept", "Uses complete sentences"]
  },
  {
    "id": 6,
    "grade_level": "grade_3_5",
    "domain": "social_studies",
    "difficulty": 3,
    "prompt_type": "picture",
    "prompt_text": "Look at this picture of a community. Describe your community. What are some important places in your community? What do people do there?",
    "image_url": "https://images.unsplash.com/photo-1567449303078-57ad995bd329?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "My community has many important places. We have a school where children learn. There is a library where people borrow books. The fire station has firefighters who help keep us safe. We also have parks where families play and stores where people buy food and clothes.",
    "rubric": ["Names multiple community places", "Describes functions of places", "Shows community understanding", "Uses varied vocabulary"]
  },
  {
    "id": 7,
    "grade_level": "grade_6_8",
    "domain": "language_arts",
    "difficulty": 3,
    "prompt_type": "picture",
    "prompt_text": "Look at these travel destinations. If you could travel to any country in the world, where would you go and why? What would you want to see or do there?",
    "image_url": "https://images.unsplash.com/photo-1488085061387-422e29b40080?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "I would travel to Japan because I am interested in its culture and technology. I would want to visit Tokyo to see the modern buildings and try Japanese food like sushi. I would also like to see ancient temples and learn about Japanese history. The cherry blossoms in spring would be beautiful to see.",
    "rubric": ["States clear destination", "Provides multiple reasons", "Includes specific activities", "Uses varied sentence structures"]
  },
  {
    "id": 8,
    "grade_level": "grade_6_8",
    "domain": "science",
    "difficulty": 4,
    "prompt_type": "picture",
    "prompt_text": "Look at these energy sources. Explain the difference between renewable and non-renewable energy sources. Give examples of each.",
    "image_url": "https://images.unsplash.com/photo-1509391366360-2e959784a276?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "Renewable energy sources can be naturally replenished. Examples include solar power from the sun, wind energy from wind turbines, and hydroelectric power from moving water. Non-renewable energy sources cannot be easily replaced once used. Examples include coal, oil, and natural gas, which take millions of years to form.",
    "rubric": ["Defines both types clearly", "Provides accurate examples for each", "Shows understanding of sustainability", "Uses appropriate scientific vocabulary"]
  },
  {
    "id": 9,
    "grade_level": "grade_6_8",
    "domain": "social_studies",
    "difficulty": 4,
    "prompt_type": "picture",
    "prompt_text": "Look at this picture showing people voting. What is democracy? Explain how it works and why it is important.",
    "image_url": "https://images.unsplash.com/photo-1540910419892-4a36d2c3266c?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "Democracy is a form of government where citizens have the power to make decisions. In a democracy, people vote to elect leaders who represent them. It is important because it gives everyone a voice in how their country is run. Democratic governments protect individual rights and freedoms, and leaders can be held accountable for their actions.",
    "rubric": ["Defines democracy accurately", "Explains the voting process", "Discusses importance", "Shows understanding of civic concepts"]
  },
  {
    "id": 10,
    "grade_level": "grade_9_12",
    "domain": "language_arts",
    "difficulty": 5,
    "prompt_type": "picture",
    "prompt_text": "Look at this image showing social media. Do you think social media has a positive or negative effect on society? Support your opinion with specific examples.",
    "image_url": "https://images.unsplash.com/photo-1611162617474-5b21e879e113?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "Social media has both positive and negative effects on society. On the positive side, it allows people to connect with friends and family around the world and gives everyone a platform to share ideas. For example, social media has helped organize important social movements. However, there are negative effects too, such as the spread of misinformation and the impact on mental health. Overall, I believe social media can be positive if used responsibly.",
    "rubric": ["Presents clear opinion", "Provides balanced analysis", "Uses specific examples", "Demonstrates critical thinking"]
  },
  {
    "id": 11,
    "grade_level": "grade_9_12",
    "domain": "science",
    "difficulty": 5,
    "prompt_type": "picture",
    "prompt_text": "Look at this medical image. Explain how vaccines work to protect the body from diseases. Include information about the immune system in your explanation.",
    "image_url": "https://images.unsplash.com/photo-1584820927498-cfe5211fd8bf?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "Vaccines work by training the immune system to recognize and fight specific diseases. When you receive a vaccine, it contains weakened or inactive parts of a pathogen that cause the disease. The immune system responds by producing antibodies and memory cells. If you later encounter the actual disease, your immune system recognizes it quickly and can fight it off more effectively. This is why vaccines can prevent serious illnesses.",
    "rubric": ["Explains vaccine mechanism", "Describes immune system response", "Uses accurate scientific terms", "Shows comprehensive understanding"]
  },
  {
    "id": 12,
    "grade_level": "grade_9_12",
    "domain": "social_studies",
    "difficulty": 5,
    "prompt_type": "picture",
    "prompt_text": "Look at this global connection image. Discuss the causes and effects of globalization. How has it changed the world we live in?",
    "image_url": "https://images.unsplash.com/photo-1526778548025-fa2f459cd5c1?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "Globalization is the increasing interconnectedness of countries through trade, technology, and cultural exchange. Causes include advances in transportation and communication technology. The effects are significant: economies are more connected, with products made in one country sold worldwide. Cultures influence each other, leading to both cultural exchange and concerns about losing traditions. While globalization has created economic opportunities, it has also raised concerns about inequality and environmental impact.",
    "rubric": ["Defines globalization", "Identifies multiple causes", "Discusses various effects", "Shows nuanced understanding"]
  },
  {
    "id": 13,
    "grade_level": "grade_9_12",
    "domain": "mathematics",
    "difficulty": 6,
    "prompt_type": "picture",
    "prompt_text": "Look at this probability visualization. Explain the concept of probability and how it is used in everyday life. Give at least two real-world examples.",
    "image_url": "https://images.unsplash.com/photo-1611974789855-9c2a0a7236a3?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "Probability is the measure of how likely an event is to occur, expressed as a number between 0 and 1. In everyday life, we use probability constantly. Weather forecasts use probability when they say there's a 70% chance of rain. Insurance companies use probability to calculate premiums based on the likelihood of accidents or health issues. Games of chance like lotteries are based entirely on probability. Understanding probability helps us make informed decisions about risk and uncertainty.",
    "rubric": ["Defines probability accurately", "Explains mathematical concept", "Provides relevant examples", "Connects theory to practice"]
  },
  {
    "id": 14,
    "grade_level": "grade_9_12",
    "domain": "language_arts",
    "difficulty": 6,
    "prompt_type": "picture",
    "prompt_text": "Look at this image about language learning. Listen to the following short speech and summarize the main points. Then give your opinion on the topic.",
    "image_url": "https://images.unsplash.com/photo-1456513080510-7bf3a84b82f8?w=800&h=600&fit=crop",
    "audio_text": "Today I want to talk about the importance of learning a second language. In our increasingly connected world, being bilingual opens many doors. Research shows that learning another language improves cognitive abilities and can even delay the onset of dementia. From a career perspective, bilingual employees often have more opportunities and can earn higher salaries. Furthermore, speaking another language allows you to connect with different cultures and see the world from new perspectives.",
    "sample_answer": "The speech argues that learning a second language is valuable for several reasons. First, it improves cognitive abilities and brain health. Second, it provides career advantages including more opportunities and higher salaries. Third, it enables cultural understanding. I agree with these points. Learning a second language has personally helped me appreciate other cultures and has improved my communication skills. However, I think access to language education should be more widely available to everyone.",
    "rubric": ["Summarizes main points accurately", "Identifies key arguments", "Provides personal opinion with reasoning", "Demonstrates listening comprehension"]
  },
  {
    "id": 15,
    "grade_level": "grade_9_12",
    "domain": "science",
    "difficulty": 6,
    "prompt_type": "picture",
    "prompt_text": "Look at this laboratory image. Describe the scientific method and explain why it is important in scientific research. Walk through each step using an example.",
    "image_url": "https://images.unsplash.com/photo-1532094349884-543bc11b234d?w=800&h=600&fit=crop",
    "audio_text": null,
    "sample_answer": "The scientific method is a systematic approach to investigation. The steps are: First, make an observation and ask a question. For example, 'Why do plants grow toward light?' Second, form a hypothesis, such as 'Plants grow toward light because they need it for photosynthesis.' Third, design and conduct an experiment to test the hypothesis. Fourth, collect and analyze data. Fifth, draw conclusions based on the evidence. Finally, communicate results. This method is crucial because it ensures that scientific conclusions are based on evidence and can be reproduced by others.",
    "rubric": ["Lists all steps correctly", "Explains importance", "Provides clear example", "Demonstrates scientific thinking"]
  }
]
